; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-7-23)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-4 - location
	p0-5 - location
	p1-2 - location
	p2-0 - location
	p2-3 - location
	p2-6 - location
	p3-0 - location
	p3-6 - location
	p3-7 - location
	p5-3 - location
	p6-7 - location
	p7-1 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s7)
	(at driver5 s7)
	(at driver6 s4)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s0)
	(at package2 s4)
	(at package3 s6)
	(at package4 s6)
	(at package5 s6)
	(at package6 s0)
	(at package7 s7)
	(at package8 s7)
	(at package9 s4)
	(at package10 s1)
	(at package11 s3)
	(at package12 s2)
	(at package13 s0)
	(at package14 s0)
	(at package15 s6)
	(at package16 s0)
	(at package17 s5)
	(at package18 s2)
	(at package19 s4)
	(at package20 s7)
	(at package21 s5)
	(at package22 s5)
	(at package23 s7)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(link s0 s5)
	(link s5 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s7)
	(link s7 s1)
	(link s2 s5)
	(link s5 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s1)
	(link s1 s6)
	(link s6 s4)
	(link s4 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s4)
	(link s4 s7)
	(link s7 s6)
	(link s6 s7)
)
	(:goal (and
	(at driver2 s6)
	(at driver3 s5)
	(at driver4 s4)
	(at driver6 s3)
	(at truck3 s3)
	(at truck4 s7)
	(at truck5 s5)
	(at truck6 s0)
	(at package1 s2)
	(at package2 s1)
	(at package3 s6)
	(at package4 s6)
	(at package5 s3)
	(at package6 s6)
	(at package7 s6)
	(at package8 s2)
	(at package9 s5)
	(at package10 s0)
	(at package12 s4)
	(at package14 s0)
	(at package15 s6)
	(at package16 s7)
	(at package17 s6)
	(at package18 s5)
	(at package20 s4)
	(at package21 s0)
	(at package22 s2)
	(at package23 s2)
	))


)

; plan
1. (board-truck driver2 s2 truck7)
   deleted: (at driver2 s2) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 4 of 28
2. (drive-truck driver2 s2 s1 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s1)
   goals met: 4 of 28
3. (drive-truck driver2 s1 s4 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s4)
   goals met: 4 of 28
4. (drive-truck driver2 s4 s5 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s5)
   goals met: 4 of 28
5. (load-truck s5 package22 truck7)
   deleted: (at package22 s5)
   added: (in package22 truck7)
   goals met: 4 of 28
6. (load-truck s5 package21 truck7)
   deleted: (at package21 s5)
   added: (in package21 truck7)
   goals met: 4 of 28
7. (load-truck s5 package17 truck7)
   deleted: (at package17 s5)
   added: (in package17 truck7)
   goals met: 4 of 28
8. (drive-truck driver2 s5 s4 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s4)
   goals met: 4 of 28
9. (load-truck s4 package9 truck7)
   deleted: (at package9 s4)
   added: (in package9 truck7)
   goals met: 4 of 28
10. (drive-truck driver2 s4 s5 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s5)
   goals met: 4 of 28
11. (unload-truck s5 package9 truck7)
   deleted: (in package9 truck7)
   added: (at package9 s5)
   goals met: 5 of 28
12. (drive-truck driver2 s5 s7 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s7)
   goals met: 5 of 28
13. (load-truck s7 package8 truck7)
   deleted: (at package8 s7)
   added: (in package8 truck7)
   goals met: 5 of 28
14. (load-truck s7 package7 truck7)
   deleted: (at package7 s7)
   added: (in package7 truck7)
   goals met: 5 of 28
15. (drive-truck driver2 s7 s5 truck7)
   deleted: (at truck7 s7)
   added: (at truck7 s5)
   goals met: 5 of 28
16. (board-truck driver3 s2 truck3)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 28
17. (drive-truck driver3 s2 s7 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   goals met: 5 of 28
18. (load-truck s7 package23 truck3)
   deleted: (at package23 s7)
   added: (in package23 truck3)
   goals met: 5 of 28
19. (drive-truck driver3 s7 s2 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   goals met: 5 of 28
20. (unload-truck s2 package23 truck3)
   deleted: (in package23 truck3)
   added: (at package23 s2)
   goals met: 6 of 28
21. (load-truck s2 package18 truck3)
   deleted: (at package18 s2)
   added: (in package18 truck3)
   goals met: 6 of 28
22. (drive-truck driver3 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 6 of 28
23. (drive-truck driver2 s5 s6 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s6)
   goals met: 6 of 28
24. (unload-truck s6 package7 truck7)
   deleted: (in package7 truck7)
   added: (at package7 s6)
   goals met: 7 of 28
25. (drive-truck driver2 s6 s7 truck7)
   deleted: (at truck7 s6)
   added: (at truck7 s7)
   goals met: 7 of 28
26. (load-truck s7 package20 truck7)
   deleted: (at package20 s7)
   added: (in package20 truck7)
   goals met: 7 of 28
27. (drive-truck driver3 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 7 of 28
28. (load-truck s0 package6 truck3)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 7 of 28
29. (drive-truck driver3 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 8 of 28
30. (walk driver6 s4 p0-4)
   deleted: (at driver6 s4)
   added: (at driver6 p0-4)
   goals met: 8 of 28
31. (walk driver6 p0-4 s0)
   deleted: (at driver6 p0-4)
   added: (at driver6 s0)
   goals met: 8 of 28
32. (board-truck driver6 s0 truck4)
   deleted: (at driver6 s0) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 8 of 28
33. (load-truck s0 package16 truck4)
   deleted: (at package16 s0)
   added: (in package16 truck4)
   goals met: 8 of 28
34. (drive-truck driver6 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 8 of 28
35. (drive-truck driver6 s4 s6 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   goals met: 8 of 28
36. (load-truck s6 package5 truck4)
   deleted: (at package5 s6)
   added: (in package5 truck4)
   goals met: 8 of 28
37. (drive-truck driver2 s7 s1 truck7)
   deleted: (at truck7 s7)
   added: (at truck7 s1)
   goals met: 8 of 28
38. (load-truck s1 package10 truck7)
   deleted: (at package10 s1)
   added: (in package10 truck7)
   goals met: 8 of 28
39. (drive-truck driver2 s1 s4 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s4)
   goals met: 8 of 28
40. (unload-truck s4 package20 truck7)
   deleted: (in package20 truck7)
   added: (at package20 s4)
   goals met: 9 of 28
41. (drive-truck driver2 s4 s7 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s7)
   goals met: 9 of 28
42. (drive-truck driver2 s7 s5 truck7)
   deleted: (at truck7 s7)
   added: (at truck7 s5)
   goals met: 9 of 28
43. (drive-truck driver6 s6 s7 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   goals met: 10 of 28
44. (unload-truck s7 package16 truck4)
   deleted: (in package16 truck4)
   added: (at package16 s7)
   goals met: 11 of 28
45. (disembark-truck driver6 s7 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s7) (empty truck4)
   goals met: 11 of 28
46. (board-truck driver4 s7 truck4)
   deleted: (at driver4 s7) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 11 of 28
47. (drive-truck driver4 s7 s4 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   goals met: 10 of 28
48. (load-truck s4 package2 truck4)
   deleted: (at package2 s4)
   added: (in package2 truck4)
   goals met: 10 of 28
49. (walk driver6 s7 p3-7)
   deleted: (at driver6 s7)
   added: (at driver6 p3-7)
   goals met: 10 of 28
50. (drive-truck driver3 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 9 of 28
51. (unload-truck s5 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s5)
   goals met: 10 of 28
52. (walk driver6 p3-7 s3)
   deleted: (at driver6 p3-7)
   added: (at driver6 s3)
   goals met: 11 of 28
53. (drive-truck driver3 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 11 of 28
54. (unload-truck s6 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s6)
   goals met: 12 of 28
55. (drive-truck driver3 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 13 of 28
56. (drive-truck driver4 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 13 of 28
57. (unload-truck s1 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 14 of 28
58. (drive-truck driver4 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 14 of 28
59. (drive-truck driver2 s5 s2 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s2)
   goals met: 14 of 28
60. (unload-truck s2 package8 truck7)
   deleted: (in package8 truck7)
   added: (at package8 s2)
   goals met: 15 of 28
61. (drive-truck driver2 s2 s5 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s5)
   goals met: 15 of 28
62. (drive-truck driver3 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 14 of 28
63. (drive-truck driver2 s5 s0 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s0)
   goals met: 14 of 28
64. (unload-truck s0 package21 truck7)
   deleted: (in package21 truck7)
   added: (at package21 s0)
   goals met: 15 of 28
65. (drive-truck driver2 s0 s5 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s5)
   goals met: 15 of 28
66. (drive-truck driver2 s5 s6 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s6)
   goals met: 15 of 28
67. (unload-truck s6 package17 truck7)
   deleted: (in package17 truck7)
   added: (at package17 s6)
   goals met: 16 of 28
68. (drive-truck driver2 s6 s5 truck7)
   deleted: (at truck7 s6)
   added: (at truck7 s5)
   goals met: 16 of 28
69. (drive-truck driver2 s5 s0 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s0)
   goals met: 16 of 28
70. (unload-truck s0 package10 truck7)
   deleted: (in package10 truck7)
   added: (at package10 s0)
   goals met: 17 of 28
71. (drive-truck driver2 s0 s5 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s5)
   goals met: 17 of 28
72. (drive-truck driver2 s5 s2 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s2)
   goals met: 17 of 28
73. (unload-truck s2 package22 truck7)
   deleted: (in package22 truck7)
   added: (at package22 s2)
   goals met: 18 of 28
74. (load-truck s2 package12 truck7)
   deleted: (at package12 s2)
   added: (in package12 truck7)
   goals met: 18 of 28
75. (drive-truck driver2 s2 s7 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s7)
   goals met: 18 of 28
76. (drive-truck driver2 s7 s4 truck7)
   deleted: (at truck7 s7)
   added: (at truck7 s4)
   goals met: 18 of 28
77. (unload-truck s4 package12 truck7)
   deleted: (in package12 truck7)
   added: (at package12 s4)
   goals met: 19 of 28
78. (drive-truck driver2 s4 s6 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s6)
   goals met: 19 of 28
79. (disembark-truck driver2 s6 truck7)
   deleted: (driving driver2 truck7)
   added: (at driver2 s6) (empty truck7)
   goals met: 20 of 28
80. (drive-truck driver4 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 20 of 28
81. (load-truck s0 package1 truck4)
   deleted: (at package1 s0)
   added: (in package1 truck4)
   goals met: 20 of 28
82. (drive-truck driver4 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 20 of 28
83. (drive-truck driver4 s4 s7 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s7)
   goals met: 21 of 28
84. (drive-truck driver4 s7 s2 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s2)
   goals met: 20 of 28
85. (unload-truck s2 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s2)
   goals met: 21 of 28
86. (drive-truck driver4 s2 s5 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   goals met: 21 of 28
87. (drive-truck driver4 s5 s3 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   goals met: 21 of 28
88. (unload-truck s3 package5 truck4)
   deleted: (in package5 truck4)
   added: (at package5 s3)
   goals met: 22 of 28
89. (drive-truck driver4 s3 s6 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   goals met: 22 of 28
90. (drive-truck driver4 s6 s4 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s4)
   goals met: 22 of 28
91. (disembark-truck driver3 s5 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 23 of 28
92. (board-truck driver6 s3 truck5)
   deleted: (at driver6 s3) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 22 of 28
93. (drive-truck driver6 s3 s5 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   goals met: 23 of 28
94. (walk driver3 s5 p5-3)
   deleted: (at driver3 s5)
   added: (at driver3 p5-3)
   goals met: 22 of 28
95. (disembark-truck driver6 s5 truck5)
   deleted: (driving driver6 truck5)
   added: (at driver6 s5) (empty truck5)
   goals met: 22 of 28
96. (walk driver3 p5-3 s3)
   deleted: (at driver3 p5-3)
   added: (at driver3 s3)
   goals met: 22 of 28
97. (board-truck driver3 s3 truck6)
   deleted: (at driver3 s3) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 22 of 28
98. (drive-truck driver3 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 23 of 28
99. (walk driver6 s5 p5-3)
   deleted: (at driver6 s5)
   added: (at driver6 p5-3)
   goals met: 23 of 28
100. (walk driver6 p5-3 s3)
   deleted: (at driver6 p5-3)
   added: (at driver6 s3)
   goals met: 24 of 28
101. (drive-truck driver4 s4 s5 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   goals met: 24 of 28
102. (drive-truck driver3 s0 s5 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   goals met: 23 of 28
103. (disembark-truck driver4 s5 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s5) (empty truck4)
   goals met: 23 of 28
104. (board-truck driver4 s5 truck2)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 23 of 28
105. (drive-truck driver4 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 23 of 28
106. (disembark-truck driver4 s4 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s4) (empty truck2)
   goals met: 24 of 28
107. (drive-truck driver3 s5 s0 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   goals met: 25 of 28
108. (walk driver6 s3 p5-3)
   deleted: (at driver6 s3)
   added: (at driver6 p5-3)
   goals met: 24 of 28
109. (walk driver6 p5-3 s5)
   deleted: (at driver6 p5-3)
   added: (at driver6 s5)
   goals met: 24 of 28
110. (drive-truck driver3 s0 s5 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   goals met: 23 of 28
111. (disembark-truck driver3 s5 truck6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s5) (empty truck6)
   goals met: 24 of 28
112. (board-truck driver3 s5 truck3)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 23 of 28
113. (board-truck driver6 s5 truck6)
   deleted: (at driver6 s5) (empty truck6)
   added: (driving driver6 truck6)
   goals met: 23 of 28
114. (disembark-truck driver3 s5 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 24 of 28
115. (drive-truck driver6 s5 s0 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   goals met: 25 of 28
116. (drive-truck driver6 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 24 of 28
117. (disembark-truck driver6 s3 truck6)
   deleted: (driving driver6 truck6)
   added: (at driver6 s3) (empty truck6)
   goals met: 25 of 28
118. (board-truck driver3 s5 truck3)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 24 of 28
119. (drive-truck driver3 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 25 of 28
120. (walk driver6 s3 p5-3)
   deleted: (at driver6 s3)
   added: (at driver6 p5-3)
   goals met: 24 of 28
121. (walk driver6 p5-3 s5)
   deleted: (at driver6 p5-3)
   added: (at driver6 s5)
   goals met: 24 of 28
122. (board-truck driver6 s5 truck4)
   deleted: (at driver6 s5) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 24 of 28
123. (disembark-truck driver3 s3 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 24 of 28
124. (drive-truck driver6 s5 s7 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   goals met: 25 of 28
125. (disembark-truck driver6 s7 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s7) (empty truck4)
   goals met: 25 of 28
126. (walk driver3 s3 p5-3)
   deleted: (at driver3 s3)
   added: (at driver3 p5-3)
   goals met: 25 of 28
127. (walk driver3 p5-3 s5)
   deleted: (at driver3 p5-3)
   added: (at driver3 s5)
   goals met: 26 of 28
128. (walk driver5 s7 p3-7)
   deleted: (at driver5 s7)
   added: (at driver5 p3-7)
   goals met: 26 of 28
129. (walk driver5 p3-7 s3)
   deleted: (at driver5 p3-7)
   added: (at driver5 s3)
   goals met: 26 of 28
130. (board-truck driver5 s3 truck6)
   deleted: (at driver5 s3) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 26 of 28
131. (drive-truck driver5 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 27 of 28
132. (walk driver6 s7 p3-7)
   deleted: (at driver6 s7)
   added: (at driver6 p3-7)
   goals met: 27 of 28
133. (walk driver6 p3-7 s3)
   deleted: (at driver6 p3-7)
   added: (at driver6 s3)
   goals met: 28 of 28
